<a href="https://colab.research.google.com/github/michelleorna/data_analytics_2/blob/main/Python/Unit%203%20Assignments/Unit3_Assignment1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
#DATA EXPLORATION
#summary statistics, means, medians, quartiles, etc

In [3]:
#Load in th salaries.csv from the github pagr
import pandas as pd
import matplotlib.pyplot as plt
salaries_df = pd.read_csv('https://raw.githubusercontent.com/CunyLaguardiaDataAnalytics/datasets/master/Salaries.csv')

In [4]:
type(salaries_df)

pandas.core.frame.DataFrame

In [5]:
salaries_df.shape

(397, 7)

In [6]:
salaries_df.head()

   Unnamed: 0      rank discipline  yrs.since.phd  yrs.service   sex  salary
0           1      Prof          B             19           18  Male  139750
1           2      Prof          B             20           16  Male  173200
2           3  AsstProf          B              4            3  Male   79750
3           4      Prof          B             45           39  Male  115000
4           5      Prof          B             40           41  Male  141500

In [7]:
salaries_df.tail()

     Unnamed: 0      rank discipline  yrs.since.phd  yrs.service   sex  salary
392         393      Prof          A             33           30  Male  103106
393         394      Prof          A             31           19  Male  150564
394         395      Prof          A             42           25  Male  101738
395         396      Prof          A             25           15  Male   95329
396         397  AsstProf          A              8            4  Male   81035

In [8]:
salaries_df.describe()

       Unnamed: 0  yrs.since.phd  yrs.service         salary
count  397.000000     397.000000   397.000000     397.000000
mean   199.000000      22.314861    17.614610  113706.458438
std    114.748275      12.887003    13.006024   30289.038695
min      1.000000       1.000000     0.000000   57800.000000
25%    100.000000      12.000000     7.000000   91000.000000
50%    199.000000      21.000000    16.000000  107300.000000
75%    298.000000      32.000000    27.000000  134185.000000
max    397.000000      56.000000    60.000000  231545.000000

# Mean/median of all salaries

In [29]:
# Median of all salaries
salaries_df['salary'].mean()

113706.45843828715

In [30]:
# Median of all salaries
salaries_df['salary'].median()

107300.0

# Median salary between gender and/or rank(title) Etc...

Making a new Data Frame that only has the columns 'sex' and 'salary'

In [10]:
salaries2_df = pd.read_csv('https://raw.githubusercontent.com/CunyLaguardiaDataAnalytics/datasets/master/Salaries.csv')

In [11]:
salaries2_df = salaries_df[['sex', 'salary']]

In [12]:
salaries2_df

      sex  salary
0    Male  139750
1    Male  173200
2    Male   79750
3    Male  115000
4    Male  141500
..    ...     ...
392  Male  103106
393  Male  150564
394  Male  101738
395  Male   95329
396  Male   81035

[397 rows x 2 columns]

Finding the Median salary for all males

In [13]:
salary_male=salaries2_df[salaries2_df['sex']=="Male"]

In [14]:
salary_male.median()

salary    108043.0
dtype: float64

Finding the Median salary for all females

In [15]:
salary_female=salaries2_df[salaries2_df['sex']=="Female"]

In [16]:
salary_female.median()

salary    103750.0
dtype: float64

*Comparing* the Mean salary of Males and Females

In [18]:
salary_male.mean()

salary    115090.418994
dtype: float64

In [19]:
salary_female.mean()

salary    101002.410256
dtype: float64

In [25]:
# The difference between mean salaries of male and female
# Males make about 14000 more than female employees.

# Data Wrangling – perform some basic transformations on the data

People who have 20 years of experience (Total: 157), (Mean Salary: 122,520.66)

In [35]:
twenty_years_exp=salaries_df[salaries_df['yrs.service']==20]

In [39]:
print(twenty_years_exp)

     Unnamed: 0  rank discipline  yrs.since.phd  yrs.service   sex  salary
8             9  Prof          B             21           20  Male  119250
16           17  Prof          B             19           20  Male  101000
82           83  Prof          B             22           20  Male  144640
94           95  Prof          B             21           20  Male  123683
173         174  Prof          B             20           20  Male  134185
209         210  Prof          B             20           20  Male  163200
223         224  Prof          B             34           20  Male  129600
225         226  Prof          A             20           20  Male  122400
353         354  Prof          B             22           20  Male  138000
371         372  Prof          A             23           20  Male  110515

In [41]:
print(twenty_years_exp.count())

Unnamed: 0       10
rank             10
discipline       10
yrs.since.phd    10
yrs.service      10
sex              10
salary           10
dtype: int64

Comparing the salaries of people who have 20+ years of experience vs less than 20 years of experience

In [42]:
m_twenty_years_exp=salaries_df[salaries_df['yrs.service']>=20]

In [43]:
l_twenty_years_exp=salaries_df[salaries_df['yrs.service']<=20]

In [48]:
print(m_twenty_years_exp['salary'])
print(l_twenty_years_exp['salary'])

3      115000
4      141500
6      175000
7      147765
8      119250
        ...
384    125192
386    139219
388    119450
392    103106
394    101738
Name: salary, Length: 157, dtype: int64
0      139750
1      173200
2       79750
5       97000
8      119250
        ...
390    166605
391    151292
393    150564
395     95329
396     81035
Name: salary, Length: 250, dtype: int64

People who have salary of greater than or equal to 200,000

In [54]:
salary_greater_200k=salaries_df[salaries_df['salary']>=200000]

In [55]:
print(salary_greater_200k)

     Unnamed: 0  rank discipline  yrs.since.phd  yrs.service   sex  salary
43           44  Prof          B             38           38  Male  231545
249         250  Prof          A             29            7  Male  204000
364         365  Prof          A             43           43  Male  205500

Your Findings here...